      ******************************************************************
      * Authors: Paul Squires, 040766405
      *          Cole Brito, 041074688
      * Course and Section: CST8283 302
      * Date: Mar 18, 2025
      * Purpose: Project 2
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJECT-2.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PORTFOLIO-FILE-IN
           ASSIGN TO "../PORTFOLIO.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT STOCK-FILE-IN
           ASSIGN TO "../STOCKS.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT REPORT-FILE-OUT
           ASSIGN TO "../REPORT.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD PORTFOLIO-FILE-IN.
       01 PORTFOLIO-RECORD.
           05 STOCK-SYMBOL-P PIC X(7).
           05 SHARES         PIC 9(5).
           05 AVERAGE-COST   PIC 9(4)V99.

       FD STOCK-FILE-IN.
       01 STOCK-RECORD.
           05 STOCK-SYMBOL-S  PIC X(7).
           05 STOCK-NAME      PIC X(25).
           05 CLOSING-PRICE   PIC 9(4)V99.

       FD REPORT-FILE-OUT.
       01 REPORT-RECORD.
           05 RECORD-STOCK-NAME        PIC X(25).
           05 FILLER                   PIC X(2) VALUE SPACES.
           05 RECORD-SHARES            PIC ZZZ,ZZ9.
           05 FILLER                   PIC X(3) VALUE SPACES.
           05 RECORD-UNIT-COST         PIC $$,$$9.99.
           05 FILLER                   PIC X(3) VALUE SPACES.
           05 RECORD-AT-CLOSING        PIC $$,$$9.99.
           05 FILLER                   PIC X(3) VALUE SPACES.
           05 RECORD-COST-BASE         PIC $$$,$$9.99.
           05 FILLER                   PIC X(3) VALUE SPACES.
           05 RECORD-MARKET-VALUE      PIC $$$,$$9.99.
           05 FILLER                   PIC X(3) VALUE SPACES.
           05 RECORD-GAIN-LOSS         PIC $$$,$$9.99-.
           05 FILLER                   PIC X(4).

       WORKING-STORAGE SECTION.
       01 HEADER-DIVISION.
           05 FILLER PIC X(97) VALUE ALL "=".

       01 STOCK-TABLE OCCURS 20 TIMES.
           05 T-STOCK-SYMBOL-S  PIC X(7).
           05 T-STOCK-NAME      PIC X(25).
           05 T-CLOSING-PRICE   PIC 9(4)V99.

       01 OUTPUT-RECORD-HEADER.
           05 HEADER-STOCK-NAME        PIC X(10) VALUE "STOCK NAME".
           05 FILLER                   PIC X(17) VALUE SPACES.
           05 HEADER-SHARES            PIC X(7) VALUE "#SHARES".
           05 FILLER                   PIC X(3) VALUE SPACES.
           05 HEADER-UNIT-COST         PIC X(9) VALUE "UNIT COST".
           05 FILLER                   PIC X(2) VALUE SPACES.
           05 HEADER-AT-CLOSING        PIC X(10) VALUE "AT CLOSING".
           05 FILLER                   PIC X(3) VALUE SPACES.
           05 HEADER-COST-BASE         PIC X(9) VALUE "COST BASE".
           05 FILLER                   PIC X(2) VALUE SPACES.
           05 HEADER-MARKET-VALUE      PIC X(12) VALUE "MARKET VALUE".
           05 FILLER                   PIC X(3) VALUE SPACES.
           05 HEADER-GAIN-LOSS         PIC X(9) VALUE "GAIN/LOSS".

       01 OUTPUT-RECORD-AUDIT.
           05 AUDIT-OUT-TITLE-READ  PIC X(13) VALUE "Records read:".
           05 FILLER PIC X(3) VALUE SPACES.
           05 AUDIT-OUT-READ-COUNT PIC Z9.
           05 FILLER PIC X(3) VALUE SPACES.
           05 AUDIT-OUT-TITLE-WRITE  PIC X(16) VALUE "Records written:".
           05 FILLER PIC X(3) VALUE SPACES.
           05 AUDIT-OUT-WRITE-COUNT PIC Z9.
           05 FILLER PIC X(3) VALUE SPACES.

       01 CONTROL-FIELDS.
           05 EOF-FLAG    PIC A VALUE "N".
           05 SUB-1       PIC 9(2) VALUE 1.
           05 STOCK-FOUND PIC A VALUE "N".

       01 TEMP-VARIABLES.
           05 ADJUSTED-COST-BASE PIC 9(6)V99.
           05 MARKET-VALUE       PIC 9(6)V99.
           05 GAIN-LOSS          PIC 9(6)V99.

       01 AUDIT-RECORD.
           05 AUDIT-RECORDS-READ    PIC 9(2).
           05 AUDIT-RECORDS-WRITTEN PIC 9(2).


       PROCEDURE DIVISION.
       100-MAIN-PROCEDURE.
            PERFORM 200-INTIALIZE.
            PERFORM 201-GENERATE-REPORT-RECORDS.
            PERFORM 202-TERMINATE.
            STOP RUN.

       200-INTIALIZE.
            PERFORM 300-OPEN-FILES.
            PERFORM 301-READ-STOCK-FILE VARYING SUB-1 FROM 1 BY 1
                UNTIL SUB-1 > 20 OR EOF-FLAG = "Y".
            PERFORM 305-CLOSE-STOCK-FILE.

       201-GENERATE-REPORT-RECORDS.
            PERFORM 302-CREATE-REPORT-HEADER.
            MOVE "N" TO EOF-FLAG.
            PERFORM 303-CREATE-REPORT-LINE UNTIL EOF-FLAG = "Y".
            PERFORM 304-CREATE-REPORT-FOOTER.

       202-TERMINATE.
            PERFORM 306-CLOSE-FILES.

       300-OPEN-FILES.
           OPEN INPUT STOCK-FILE-IN.
           OPEN INPUT PORTFOLIO-FILE-IN.
           OPEN OUTPUT REPORT-FILE-OUT.

       301-READ-STOCK-FILE.
           READ STOCK-FILE-IN AT END MOVE "Y" TO EOF-FLAG
           NOT AT END
               MOVE STOCK-RECORD TO STOCK-TABLE (SUB-1).

       302-CREATE-REPORT-HEADER.
            WRITE REPORT-RECORD FROM HEADER-DIVISION.
            WRITE REPORT-RECORD FROM OUTPUT-RECORD-HEADER.
            WRITE REPORT-RECORD FROM HEADER-DIVISION.
            MOVE SPACES TO REPORT-RECORD.

       303-CREATE-REPORT-LINE.
            MOVE "N" TO STOCK-FOUND.
            PERFORM 401-SEARCH-STOCK-RECORD VARYING SUB-1 FROM 1 BY 1
                UNTIL STOCK-FOUND = "Y" OR SUB-1 > 20.
            IF (STOCK-FOUND = "Y") THEN
                PERFORM 402-CREATE-REPORT-RECORD
            END-IF.
            PERFORM 400-READ-PORTFOLIO-RECORD.

       304-CREATE-REPORT-FOOTER.
            WRITE REPORT-RECORD FROM HEADER-DIVISION.
            MOVE SPACES TO REPORT-RECORD.
            WRITE REPORT-RECORD.
            MOVE AUDIT-RECORDS-READ TO AUDIT-OUT-READ-COUNT.
            MOVE AUDIT-RECORDS-WRITTEN TO AUDIT-OUT-WRITE-COUNT.
            MOVE OUTPUT-RECORD-AUDIT TO REPORT-RECORD.
            WRITE REPORT-RECORD.

       305-CLOSE-STOCK-FILE.
            CLOSE STOCK-FILE-IN.

       306-CLOSE-FILES.
            CLOSE PORTFOLIO-FILE-IN.
            CLOSE REPORT-FILE-OUT.

       400-READ-PORTFOLIO-RECORD.
            READ PORTFOLIO-FILE-IN
                AT END MOVE "Y" TO EOF-FLAG.

       401-SEARCH-STOCK-RECORD.
            IF (T-STOCK-SYMBOL-S(SUB-1) = STOCK-SYMBOL-P) THEN
                MOVE "Y" TO STOCK-FOUND
                SUBTRACT 1 FROM SUB-1
            END-IF.

       402-CREATE-REPORT-RECORD.
            MOVE T-STOCK-NAME(SUB-1) TO RECORD-STOCK-NAME.
            MOVE SHARES TO RECORD-SHARES.
            MOVE AVERAGE-COST TO RECORD-UNIT-COST.
            MOVE T-CLOSING-PRICE(SUB-1) TO RECORD-AT-CLOSING.
            MULTIPLY SHARES BY AVERAGE-COST
                GIVING ADJUSTED-COST-BASE.
            MOVE ADJUSTED-COST-BASE TO RECORD-COST-BASE.
            MULTIPLY SHARES BY T-CLOSING-PRICE(SUB-1)
                GIVING MARKET-VALUE.
            MOVE MARKET-VALUE TO RECORD-MARKET-VALUE.
            SUBTRACT ADJUSTED-COST-BASE FROM MARKET-VALUE
                GIVING GAIN-LOSS.
            MOVE GAIN-LOSS TO RECORD-GAIN-LOSS.
            WRITE REPORT-RECORD.

       END PROGRAM PROJECT-2.
